In [1]:
# %%
import pandas as pd

df = pd.read_csv('rides.csv')
df

        name  plate  distance
0      Gomez   1XZ2      3.70
1   Morticia    NaN      2.10
2     Fester             3.40
3      Lurch  Q38X3     -3.20
4        NaN    03A     14.30
5  Wednesday      A      0.30
6    Pugsley  ZF003    153.14

In [2]:
# Find out all the rows that have bad values
# - Missing values are not allowed
# - A plate must be a combination of at least 3 upper case letters or digits
# - Distance much be bigger than 0
null_mask = df.isnull().any(axis=1)
df[null_mask]

       name plate  distance
1  Morticia   NaN       2.1
4       NaN   03A      14.3

In [3]:
plate_mask = ~df['plate'].str.match(r'^[0-9A-Z]{3,}', na=False)
df[plate_mask]

        name plate  distance
1   Morticia   NaN       2.1
2     Fester             3.4
5  Wednesday     A       0.3

In [4]:
dist_mask = df['distance'] < 0
df[dist_mask]

    name  plate  distance
3  Lurch  Q38X3      -3.2

In [5]:
mask = null_mask | plate_mask | dist_mask
df[mask]

        name  plate  distance
1   Morticia    NaN       2.1
2     Fester              3.4
3      Lurch  Q38X3      -3.2
4        NaN    03A      14.3
5  Wednesday      A       0.3